<template>
  <v-container
    style="padding-left: 10%; padding-right: 10%; padding-bottom: 7%; padding-top: 2%;"
  >
    <v-row style="text-align:center; margin-bottom: 30px;">
      <p>您好，欢迎访问这个页面。这个页面包含了我的遗言，以及遗嘱。本页面将会不定期更新，直至其正式生效。</p>
    </v-row>
    <!-- <h1>我对所有人的遗言</h1>
      <p>很抱歉地告诉大家，我死了。这真糟糕，这代表着我不能享受生活了。我真的会很想念活着的，活着真不错。活着的时候我有人去爱，有事情去享受。我再也不能和 
        我往常爱的人们一起聊天和做事情了。仔细想想，这代表着我不能再见到我的家人，朋友，和我喜欢的人，不能和他们开展对话或者做喜欢的事情。这代表着我不再有机会
        半夜喝醉晃荡在梅陇西路上；不再有机会和喜欢的人看一场电影、或是看看海；不再有机会和我妈吵架；不再有机会和我的朋友从12/31日骑车到1/1日。😮‍💨，想想就难受！！！
        他马勒戈壁的，活着真好。大家千万不要死啊！死了真的会好难过，因为活着能见的人和做的事也太快乐了！
      </p>
      <p>唉，但是没办法，人终将死。像我，现在就死掉了！他妈的，真操蛋！但是可能也是时候了。反正都得死，不如好好的面对它。</p>
      <p>我觉得对于我来说，相对于面对死亡，我更害怕的是接受离开吧～</p>
      <p>我其实并不惧怕死亡，因为我都不知道死亡之后会发生什么！无知者无畏，我没必要对我不知道的东西产生恐惧。死的时候应该很痛吧，我挺怕疼的，所以应该会害怕死亡的过程。希望我的死因是无痛的。</p>
      <p>真难呀，接受自己很快将会离开这个世界。我想到这个可能性时敲键盘的手就已经开始发抖了😨。唉，但是总得说再见的，既然要说再见，那就好好说吧！</p>
      <p>再见:</p>
      <p>再见，所有和我有过交集的人们，希望你们与我交集的时候是快乐的！</p>
      <p>再见，我的老师们，你们给了我只有人类才能拥有的东西：知识！（那些不认真教课的老师，我希望你们能够好好教自己的学生）</p>
      <p>再见，我的朋友们，和你们真的很开心很开心，希望我也让你们很开心很开心，下辈子再见！（如果还有的话，我信佛，所以应该有）</p>
      <p>再见，我喜欢和喜欢过的人们，希望我给你们印象还不错～希望你们都能很幸福地活着！</p>
      <p>那些我没在这里说再见的，重要的人们，我会在之后单独的遗言对你们说再见！</p>
      <p>再见了啊，大家！再见！（笑死了，我突然想到了陈奕迅的不要说话）</p>
      <p>就这样吧！说完再见后，我的心情也舒畅很多了！真的很感谢各位，陪我完成了在人间这么一个前无古人后无来者的冒险！唉，其实还是有点舍不得，就让这么点舍不得变成大家的泪水吧！希望大家多哭一哭，闹一闹。我如果灵魂在葬礼现场的话看到会很开心的！</p>
      <p>拜拜！大家可以开始哭了！</p>
      <p>祝一切顺利，翁安志，终</p>
      <!-- <p>再见，妈妈，谢谢你给予我生命，这世界上最宝贵的东西。太牛逼了，真的太牛逼了，你给了我生命。希望你一辈子都能是最好最好的！</p>
      <p>再见，Mr.Mulson，You are the best teacher that I have ever met in my life. I hope that many people also think the same way!</p>
      <p>再见，赵雪伦，我很开心我们是朋友，也很开心我们所有的共同回忆。希望你能够真正开心地，慢慢地，享受生活。</p>
      <p>再见，俞妮，我很开心</p> --> -->
  </v-container>
</template>

<script>

export default {
  data: () => ({
    icons: [
      "mdi-link-box-variant-outline",
      "mdi-twitter",
      "mdi-linkedin",
      "mdi-facebook",
    ],
    copied: false,
    blog: {
      title: "42",
      article: "# Whoops! Seems like you have reached a nonexisting article ;)",
      img: "",
    },
    fileContent: null,
  }),
  components: {
    
  },
  beforeMount() {

  },
  methods: {
    
  },
};
</script>

<style>
 h1 {
   font-weight: 400;
 }
</style>